Tekla Open API Reference for Tekla Structures 2025
PluginUserInterfaceAttribute Constructor
 The custom attribute [PluginUserInterface(PluginName.UserInterfaceDefinitions.Plugin1)] uses this to store the description of the plug-in user interface to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginUserInterfaceAttribute(
	string description
)
Public Sub New (
	description As String
)
Parameters
description
Type: System.String
The description of the plug-in user interface in inp format or the name of the dialog class for the PluginFormBase dialog.
See Also
Reference
PluginUserInterfaceAttribute Class
Tekla.Structures.Plugins Namespace